cylinderCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       376000;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       377600;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          12800;
        startFace       379200;
    }
)

// ************************************************************************* //
